$(document).ready(function () {
var pos_or_neg = true;
$(window).resize(function () {
    if ($(window).width() <= 992 && $(window).width() >= 762) {
         if(pos_or_neg){
             addSpan();
         }
    }
    if ($(window).width() >= 992) {
        $('.about span').remove();
        $('.about').css('height','250px');
        pos_or_neg = true;
    }
});

    function addSpan() {
            $('.about:eq(0) .container .row:eq(0)').append('<span>ЕкоПлант – це екологічно чисте, безхлорне, комплексне мінеральне добриво рослинного походження.</span><span>Добриво ЕкоПлант проявляє високу ефективність на ранніх стадіях розвитку овочевих культур, кукурудзи, соняшнику, озимого і ярого ріпаку.</span>');
            $('.about:eq(1) .container .row:eq(0)').append('<span>Завдяки своїй гранульованій формі ЕкоПлант розчиняється поступово, що запобігає його вимиванню з орного шару ґрунту, та має певний ефект післядії.</span><span>За п\'ятнадцять років виробництва переваги добрива ЕкоПлант оцінили сотні сільськогосподарських підприємств  України, Литви, Латвії, Польщі, Швеції і Німеччини.</span>');
            $('.about:eq(2) .container .row:eq(0)').append('<span>При застосуванні добрива ЕкоПлант доведено, збільшення в продукції вмісту сухих речовин: білків у зернових, жирів у олійних і вуглеводів у овочевих, фруктів\n' +
                '                        та цукрових буряків, що покращує їх якість.</span><span>Застосування ЕкоПланту як калійно-кальцієвого добрива знижує накопичення радіонуклідів в рослинах, оскільки при нестачі калію та кальцію в грунті рослини починають\n' +
                '                        інтенсивно поглинати їх «замінники» - цезій і стронцій.</span>');
            $('.about:eq(3) .container .row:eq(0)').append('<span>В 2002 році ЕкоПлант пройшло державне випробування в Інституті Картоплярства НАН України. Результати свідчать, що при застосуванні добрива було отримано як найвищий урожай картоплі, так і найвищу якість продукції.</span><span>ЕкоПлант - фізіологічно лужне добриво (рН 10-12). Bоно володіє високою нейтралізуючою здатністю, завдяки чому знижує кислотність ґрунту, що робить ЕкоПлант® особливо ефективним\n' +
                '                        на кислих ґрунтах.</span>');
            pos_or_neg = false;
    }

    if ($(window).width() <= 992 && $(window).width() >= 762) {
        addSpan();
    }


    $(window).scroll(function () {
        var topPx = $(this).scrollTop();

        // console.log(topPx);

        if ($(window).width() <= 992 && $(window).width() >= 762) {
            if (topPx > 450) {
                $('.about:eq(0)').css({height: '250px'});
            }
            if (topPx > 750 || topPx < 450) {
                $('.about:eq(0)').css({height: '130px'});
            }

            if (topPx > 1300) {
                $('.about:eq(1)').css({height: '250px'});
            }
            if (topPx > 1600 || topPx < 1300) {
                $('.about:eq(1)').css({height: '130px'});
            }

            if (topPx > 2300) {
                $('.about:eq(2)').css({height: '250px'});
            }
            if (topPx > 2600 || topPx < 2300) {
                $('.about:eq(2)').css({height: '130px'});
            }

            if (topPx > 3300) {
                $('.about:eq(3)').css({height: '250px'});
            }
            if (topPx > 3600 || topPx < 3300) {
                $('.about:eq(3)').css({height: '130px'});
            }
        }
        $('.about span').css({
            width : '50%',
            display : 'inline-block',
            textAlign : 'center',
            padding: '15px 0 0 5px'
        });


    });

    if ($(window).width() <= 572) {
        $('#dosage table tr:first th:eq(1)').text('кг/100м2')
    }

    $(function($){
        $(".phone").mask("(999) 999-9999");
    });

});